{
    "todo" : {
      "title" : "Todo",
      "coop" : "Solo",
      "skill" : "MongoDB, Express, React, Node.js, HTML/CSS",
      "date" : "June 2022",
      "url" : "https://sptech-todo.netlify.app",
      "github" : "https://github.com/SeyeongPark/todo-mern-backend", 
      "description" : "A simple web application helps users stay organized and managed by adding their tasks to lists.</br>In this application, the user can check all of the items on the list and create, delete, and make each to-do item to the 'completed' state.</br></br> Also, user can access this application not only on their local computer but also everywhere that have an internet connection by using user authentication.<div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/todo/td-detail.png'/></div>",
      "learned": "- Developing <b>CRUD</b> operation with the API server with <b>MongoDB</b></br>- Hosting the back-end (server) side and connecting it with the front-end(client) side</br>- Styling advanced UI/UX with <b>JSX(using a conditional operator)</b> and <b>CSS</b> (using root, hover..)</br>- Setting authentication with a json <b>web token</b>"
    },
    "emp" : {
      "title" : "Employee Time Tracker",
      "coop" : "Solo",
      "skill" : "Java, MySQL, Spring Framework, HTML/CSS",
      "date" : "May 2022",
      "url" : "https://timestamp-app-1.herokuapp.com",
      "github" : "https://github.com/SeyeongPark/PartTime-TimeStamp", 
      "description" : "A web application that records employees' working time stamps from start to finish, and allows the manager to access all information. </br></br>In this application, there are 2 main roles, employee and manager. All workers can record their working hours by clicking the 'record' button and will be calculated their working hours based on starting to finishing work on the main page. On the 'My Employee' page, a manager can check not only all employees' information for working hours, but also update their salary and specific position.</br>(For conveniently demonstrating this app, the timer will be counted as minutely not hourly) </br></br> Test account </br> Email : employee1@sptech.com </br> Password : password<div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/timetracker/tt-detail.png'/><h3>Project Database Diagram </h3><img loading='lazy' id='detail-img' src='../images/projects/timetracker/db_diagram.png'</div>",
      "learned": "- Structuring of <b>Relational Database Management System (RDBMS)</b> and entity for a database using <b>MySQL</b></br>- Implementing Controller for all features integrating with <b>Restful API</b></br>- Setting the authentication to log in and permission for a manager page"
    },
  
    "hotauc" : {
      "title" : "HotAuc Action",
      "coop" : "Team",
      "skill" : "JavaScript, React.js, MongoDB, HTML/CSS",
      "date" : "APRIL 2022",
      "description" : "HotAuc is a web application where Hot Wheels collectors can buy and sell cars over auctions. Moreover, the application allows buyers to pay for a winning bid over Paypal, sellers to check their earnings and administrators to edit information. <br> <div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/hotauc/pages.png'/></div>",
      "contribution" : "- Implemented a <b>user interface</b> for results of the payment based on returned data from Payment API (PayPal)<br/>- Showed the users’ selling/ buying information (total earnings, each information of items..), which is stored on <b>MongoDB</b><br/>- Designed <b>UX/UI</b> of user dashboard frame",
      "learned": "- Understanding <b>React.js</b> and <b>MongoDB</b> (module, schema, api..)  </br>- Communicating with team (8) members and Reporting my worked tasks during the meeting </br>- Reading and understanding other team members's code"
    },
    "serveymaker" : {
      "title" : "Super Survey Maker",
      "coop" : "Team",
      "skill" : "HTML/CSS",
      "date" : "DECEMBER 2020",
      "url" : "https://team1c-f2020.herokuapp.com",
      "github" : "https://github.com/jodoubleny/team1c", 
      "description" : "A web application where users can create their own surveys and manage the surveys.<br/><br/>A logged-in user is able to create a survey based on the survey template. All of the surveys will show on the ‘List of surveys’ page. Through the ‘My Survey’ page, the user can check the user’s survey and edit/delete the survey.<div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/surveymaker/pages.png'/><img loading='lazy' id='detail-img' src='../images/projects/surveymaker/detail-sm.png'/></div>",
      "contribution" : "- Designed <b>UX/UI</b> for all web pages as a Web Designer<br/>- Documented an External Design Document (Style Guide) which is included wireframes for each page, color swatches, mockups, navigation schematic, and so on",
      "learned": "- Understanding styling for <b>HTML</b> and <b>CSS</b></br>- Communicating with team members and Reporting my worked tasks during the meeting"
    },
    "urqr" : {
      "title" : "URQR",
      "coop" : "Team",
      "skill" : "MongoDB, Express, React, Node.js, AWS, HTML/CSS",
      "date" : "SEPTEMBER 2022",
      "github": "https://github.com/SeyeongPark/URQR-client",
      "url" : "https://sptech-urqr.herokuapp.com",

      "description" : "A web/mobile application that generates a QR code that shows child information for an emergency card when scanned by a phone camera. </br>URQR makes your QR(Quick Response) code which can store your child's information! In this QR code, you can store contact information to check the child’s protector. With a phone camera, you can scan the QR code easily and it will show your child's card information page!</br></br><b>[v1.0] - SEPTEMBER 30</b> </br>• Generating a QR code with input information(Name, BirthDate, Phone number, School Info, Special Info, and password) </br>• Checking the card information page by scanning the QR code using a phone camera</br></i>• Editing/Updating card information (require a password) </br></br><b>[v2.0] - OCTOBER 16</b></br>• [New features] Uploading an image in a card to help identify your child </br>• Designing a user interface for the mobile version </br></br><b>[v3.0] - OCTOBER 26</b></br>• Designing new UX/UI for searching card page</br>• [New features] Deleting a card (require a password)<div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/urqr/detail-urqr.png'/></div>",
      
      "learned": 
      "-  Interacting with external libraries' framework (<a href='https://www.npmjs.com/package/react-qr-code'>react-qr-code</a>) and components</br>- The concept of asynchronous and synchronous</br>- The generating a QR code and resulting"
    }
}

