{
    "todo" : {
      "title" : "Todo",
      "coop" : "Solo",
      "skill" : "React, MongoDB, Express, Node.js, HTML/CSS",
      "date" : "June 2022",
      "url" : "https://sptech-todo.netlify.app",
      "github" : "https://github.com/SeyeongPark/todo-mern-client", 
      "description" : "A web application that helps users stay organized by adding their tasks to ToDo lists. </br></br> In this application, a user can create, read, and delete the ToDo lists, and change a task to the 'completed' state.<div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/todo/td-detail.png'/></div>",
      "learned": "- Developing CRUD operations with the <b>RESTful API</b> and storing data using <b>MongoDB</b></br>- Interacting with the back-end(server) and the front-end(client) using <b>Express.js</b> and <b>Node.js</b></br>- Styling advanced <b>UI/UX</b> using JSX and CSS</br>- Introducing web authentication using modules, <b>JWT</b> and <b>JOI</b> in the back end"
    },
    "emp" : {
      "title" : "Employee Time Tracker",
      "coop" : "Solo",
      "skill" : "Java, MySQL, Spring Boot, HTML/CSS",
      "date" : "May 2022",
      "url" : "https://timestamp-app-1.herokuapp.com",
      "github" : "https://github.com/SeyeongPark/java-timestamp", 
      "description" : "A web application that helps employees and managers track time stamps. </br></br>All employees can record their working hours from start to end which will be calculated their working hours on the main page.  </br></br>On the 'My Employee' page, a user who is assigned a 'manager' role can check not only all employees' information including their working hours but also update their salary information and specific position. </br>(For conveniently demonstrating this app, the timer will be counted as minutely not hourly) </br></br> <b>Test account</b> </br>(role: manager) </br> Email : manager1@sptech.com </br> Password : password </br>-</br> (role: employee) </br> Email : arons@spech.com </br> Password : password<div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/timetracker/tt-detail.png'/><h3>Project Database Diagram </h3><img loading='lazy' id='detail-img' src='../images/projects/timetracker/db_diagram.png'</div>",
      "learned": "- Structuring of <b>Relational Database Management System (RDBMS)</b> and entity using <b>MySQL</b> </br>- Query data for CRUD using <b>Java Persistence Query Language (JPQL)</b></br>- Using <b>Web Security Configurer Adapter</b> in Spring Security for implementing authentication (login) and limit page permissions"
    },
  
    "hotauc" : {
      "title" : "HotAuc Action",
      "coop" : "Team",
      "skill" : "JavaScript, React.js, MongoDB, HTML/CSS",
      "date" : "APRIL 2022",
      "description" : "A web application where Hot Wheels collectors buy and sell collections through auctions. </br></br>A user can make an auction and check each earnings about the items and edit/update auction information. After the bidding period is finished, the final highest bidder can make the payment for the auction item using Paypal.  <br> <div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/hotauc/pages.png'/></div>",
      "contribution" : "- Built a <b>user interface</b> to show the results of the payment based on returned data from <b>Payment API</b> (PayPal)<br/>- Implemented a dashboard for a user’s selling/ buying detail (including total earnings and the information of each auction item) using data from <b>MongoDB</b><br/>- Designed <b>UX/UI</b> of a dashboard frame using <b>JavaScript</b> and <b>HTML/CSS</b>",
      "learned": "- Understanding handling <b>React.js</b> and <b>MongoDB</b> (module, schema, API, and so on) </br>- Communicating with other developers about team working process and explaining my tasks currently working on in the regular meetings</br>- Reviewing and understanding other developers' code and following the project schedule"
    },
    "serveymaker" : {
      "title" : "Super Survey Maker",
      "coop" : "Team",
      "skill" : "HTML/CSS",
      "date" : "DECEMBER 2020",
      "github" : "https://github.com/jodoubleny/team1c", 
      "description" : "A web application where users can create their own surveys and manage the surveys.<br/><br/>A user can create a new survey and add questions. All of the surveys will be listed on the ‘List of surveys’ page. On the ‘My Survey’ page, the user can check, edit, and delete surveys.<div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/surveymaker/pages.png'/><img loading='lazy' id='detail-img' src='../images/projects/surveymaker/detail-sm.png'/></div>",
      "contribution" : "As a <b>Web Designer</b>,</br>- Designed <b>UX/UI</b> for all web pages using <b>HTML/CSS</b></br>- Documented an External Design Document (Style Guide) which included wireframes for each page, colour swatches, mockups, navigation schematic, and so on",
      "learned": "- Understanding basic styling structure of <b>HTML</b> and <b>CSS</b></br>- Communicating with team members and explaining my tasks working on during the regular meetings"
    },
    "urqr" : {
      "title" : "URQR",
      "coop" : "Team",
      "skill" : "React, MongoDB, Express, Node.js, AWS, HTML/CSS",
      "date" : "SEPTEMBER 2022",
      "github": "https://github.com/SeyeongPark/URQR-client",
      "url" : "https://sptech-urqr.herokuapp.com",

      "description" : "A web/mobile application that generates a QR code that shows child information for an emergency card when scanned by a phone camera. </br>URQR makes your QR(Quick Response) code which can store your child's information! In this QR code, you can store contact information to check the child’s protector. With a phone camera, you can scan the QR code easily and it will show your child's card information page!</br></br><b>[v1.0] - SEPTEMBER 30</b> </br>• Generating a QR code with input information(Name, BirthDate, Phone number, School Info, Special Info, and password) </br>• Checking the card information page by scanning the QR code using a phone camera</br></i>• Editing/Updating card information (require a password) </br></br><b>[v2.0] - OCTOBER 16</b></br>• [New features] Uploading an image in a card to help identify your child </br>• Designing a user interface for the mobile version </br></br><b>[v3.0] - OCTOBER 26</b></br>• Designing new UX/UI for searching card page</br>• [New features] Deleting a card (require a password)<div className='img-container'><img loading='lazy' id='detail-img' src='../images/projects/urqr/detail-urqr.png'/></div>",
      
      "learned": 
      "-  Interacting with external libraries' framework (<a href='https://www.npmjs.com/package/react-qr-code'>react-qr-code</a>) and components</br>- The concept of asynchronous and synchronous</br>- The generating a QR code and resulting"
    }
}

